Repository: ThePragmaticTendencies/GitHub_WalletPiggy
Catalog: Strings/*/Resources.resw
Source language: en
Languages: pl_pl

# BackUpInfo.Text
source: Back-Up Info
pl_pl: Przywracanie bazy kosztów

# BackUpNOOKbutton.Text
source: Clear DataBase
pl_pl: Wyczyść bazę

# BackUpStory.Text
source: Back-up option can be performed only with available SD card installed in the device. At least till I will fix it.. Clearing whole data-base is available for all of the devices right now, not big advantage though. If something goes wrong, don't worry! Changes will be permanent only after adding/deleting costs in the app, so to undo them just close the app and re-run (to close means, to terminate it from background). To perform back-up obtain JSON format data-base file (costDB.json) via e-mail (just send it with button above) or copy it from the WalletPiggy automatic folder location ("..\SD card\WalletPiggy_BackUps"). Next step is to paste this file (don't change the original name) into "..\SD card\WalletPiggy_BackUps\LoadFromHere". When all of this is done, close the app and when running it again, in the upper left side of the loading screen "+" symbol button is visible for about a second - tap it and follow the instructions. To clear the data-base, leave the "..\LoadFromHere" folder empty, tap the "+" button on loading screen and.. follow the instructions.
pl_pl: Przywrócenie starej bazy jest możliwe tylko za pomocą zainstalowanej karty SD. Przynajmniej do kiedy tego nie poprawię.. Wyczyszczenie bazy danych jest za to dostępne dla wszystkich użytkowników. Jeżeli przypadkowo zostanie wgrana niewłaściwa baza danych, lub zostanie wykasowana - nie martwcie się! Wystarczy od razu zamknąć aplikację i uruchomić od nowa (zamknąć, czyli usunąć z tła). Operacje na bazach są utrwalane dopiero wtedy, kiedy doda się lub odejmie koszty. Aby wykonać przywróćenie bazy danych należy posiadać starą jej wersję w formacie JSON. W każdej chwili można taką wysłać na mail'a (przycisk powyżej) lub skopiowac z domyślnej lokalizacji WalletPiggy: "..\SD card\WalletPiggy_BackUps". Następnym krokiem jest umieszczenie pliku bazy danych (costDB.json, nie należy zmieniać nazwy pliku) w lokalizacji: "..\SD card\WalletPiggy_BackUps\LoadFromHere". Kiedy mamy to za sobą, zamykamy aplikację (usuwając z tła) i uruchamiamy ponownie. Na ekranie łądowania, w górnej-lewej cześci jest widoczny przycisk z symbolem "+". Naciśniecie go rozpocznie proces przywracania, wystarczy postępować zgodnie z komunikatami. W celu wyczyszczenia bazy danych wystarczy pozostawić lokalizację "..\LoadFromHere" pustą i nacisnąć symbol "+" na ekranie ładowania.

# BackUpTERMINATEbutton.Text
source: EXIT
pl_pl: Wyjdź

# Contact.Text
source: Contact: ThePragmaticTendencies@gmail.com
pl_pl: Kontakt: ThePragmaticTendencies@gmail.com

# CostsHeader.Text
source: Costs will show here!
pl_pl: Tutaj pojawią się Twoje koszty!

# CostsHeaderSubtitle.Text
source: Hold cost to delete.
pl_pl: Przytrzymaj koszt aby usunąć.

# Delete.Text
source: Delete
pl_pl: Usuń

# Language/Currency.Text
source: Language / Currency
pl_pl: Język / Waluta

# MonthlySummary.Text
source: Monthly Summary
pl_pl: Ten miesiąc

# NOOK.Text
source: No
pl_pl: Nie

# OK.Text
source: Yes
pl_pl: Tak

# PreviousMonth.Text
source: Previous Month
pl_pl: Poprzedni miesiąc

# SendCostsInCSV.Text
source: Send Costs in CSV via e-mail
pl_pl: Wyślij koszty CSV

# SendJSONBackUp.Text
source: Send JSON Back-up via e-mail
pl_pl: Wyślij bazę danych JSON

# Settings.Text
source: Settings
pl_pl: Ustawienia

# Settings_NotificationTextBlock.Text
source: Restart application for change to take effect
pl_pl: Uruchom ponownie aplikacje w celu wprowadzenia zmian
